Modules/VanBanDen/Http/Controllers/DonViNhanVanBanDenController.php

    public function index(Request $request)
    {
        $hienthi = $request->get('don_vi_van_ban');

        $donVi = auth::user()->donVi;
        $donViId = $donVi->id;

        if (auth::user()->hasRole(VAN_THU_DON_VI)) {
            $donViId = $donVi->parent_id;
        }
        $donvinhan = NoiNhanVanBanDi::where(['don_vi_id_nhan' => $donViId])->whereIn('trang_thai', [2])
            ->where(function ($query) use ($hienthi) {
                if (!empty($hienthi)) {
                    return $query->where('trang_thai', "$hienthi");
                }
            })
            ->paginate(PER_PAGE);



        $vanbanhuyenxuongdonvi = DonViChuTri::with('canBoChuyen')
            ->where(['don_vi_id' => $donViId])->whereNull('vao_so_van_ban')
            ->where(function ($query) use ($hienthi) {
                if (!empty($hienthi)) {
                    if ($hienthi == 2)
                        return $query->whereNull('vao_so_van_ban');
---
select * from `so_van_ban` where `deleted_at` is null and `so_van_ban`.`deleted_at` is null order by `id` asc
select * from `loai_van_ban` where `deleted_at` is null and `loai_van_ban`.`deleted_at` is null order by `id` asc