Modules/DieuHanhVanBanDen/Http/Controllers/DieuHanhVanBanDenController.php

    public function show($id, Request $request)
    {
        $vanBanDen = VanBanDen::with(['loaiVanBan', 'soVanBan', 'doKhan', 'doBaoMat',
            'xuLyVanBanDen', 'XuLyVanBanDenTraLai', 'donViChuTri', 'donViPhoiHop',
            'giaHanVanBan', 'chuyenVienPhoiHopGiaiQuyet', 'duThaoVanBan',
            'giaiQuyetVanBan' => function ($query) {
                return $query->select('id', 'van_ban_den_id', 'noi_dung', 'noi_dung_nhan_xet',
                    'user_id', 'can_bo_duyet_id', 'status', 'created_at', 'parent_id');
            }
            ])
            ->findOrFail($id);

        //phoi hop
        $type = $request->get('status') ?? null;

        if ($vanBanDen) {
            $vanBanDen->hasChild = $vanBanDen->hasChild($type) ?? null;
        }

        $loaiVanBanGiayMoi = LoaiVanBan::where('ten_loai_van_ban', "LIKE", 'giấy mời')
            ->select('id')->first();

        // data cua du thao
        $date = Carbon::now()->format('Y-m-d');
        $ds_loaiVanBan = LoaiVanBan::whereNull('deleted_at')->whereIn('loai_van_ban', [2, 3])
            ->orderBy('ten_loai_van_ban', 'desc')->get();
---
select * from `dhvbd_don_vi_chu_tri` where `dhvbd_don_vi_chu_tri`.`van_ban_den_id` in (1)
select * from `dhvbd_don_vi_phoi_hop` where `dhvbd_don_vi_phoi_hop`.`van_ban_den_id` in (1)
select * from `dhvbd_gia_han_van_ban` where `dhvbd_gia_han_van_ban`.`van_ban_den_id` in (1)
select * from `do_bao_mat` where `do_bao_mat`.`id` in (1) and `do_bao_mat`.`deleted_at` is null
select * from `loai_van_ban` where `deleted_at` is null and `loai_van_ban` in (2, 3) and `loai_van_ban`.`deleted_at` is null order by `ten_loai_van_ban` desc