Modules/DieuHanhVanBanDen/Http/Controllers/VanBanDenPhoiHopController.php

select count(*) as aggregate from `van_ban_den` where `id` in (1) and `van_ban_den`.`deleted_at` is null
---
                        return $query->where(DB::raw('lower(so_ky_hieu)'), 'LIKE', "%" . mb_strtolower($soKyHieu) . "%");
                    }
                })
//                ->where(function ($query) use ($soDen) {
//                    if (!empty($soDen)) {
//                        return $query->where('so_den', $soDen);
//                    }
//                })
                ->where(function ($query) use ($timSoDen,$soDen,$vanBanDen) {
                    if (!empty($soDen) && $vanBanDen) {
                        return $query->where('id',$timSoDen);
                    }else{
                        if (!empty($soDen))
                        {
                            return $query->where('so_den',$soDen);
                        }
                    }
                })
                ->where(function ($query) use ($date) {
                    if (!empty($date)) {
                        return $query->where('updated_at', "LIKE", $date);
                    }
                })
                ->where('trinh_tu_nhan_van_ban', '!=',VanBanDen::HOAN_THANH_VAN_BAN)
                ->whereIn('id', $arrVanBanDenId)
                ->orderBy('updated_at', $a)
                ->paginate(PER_PAGE);