Modules/Admin/Http/Controllers/AdminController.php

    public function index()
    {
        $vanThuVanBanDiPiceCharts = [];
        $vanThuVanBanDenPiceCharts = [];
        $vanThuVanBanDiCoLors = [];
        $vanThuVanBanDenCoLors = [];
        $duThaoCoLors = [];
        $duThaoPiceCharts = [];
        $user = auth::user();
        if ($user->hasRole('admin')) {
            return redirect()->route('nguoi-dung.index');
        }
        $danhSachDuThao = Duthaovanbandi::where(['nguoi_tao' => auth::user()->id, 'stt' => 1])->count();
        $vanbandichoduyet = Vanbandichoduyet::where(['can_bo_nhan_id' => auth::user()->id, 'trang_thai' => 1])->count();
        $van_ban_di_tra_lai = Vanbandichoduyet::where(['can_bo_nhan_id' => auth::user()->id, 'trang_thai' => 0, 'tra_lai' => 1])->count();
---
select count(*) as aggregate from `dtvb_du_thao_van_ban_di` where (`nguoi_tao` = 3 and `stt` = 1) and `dtvb_du_thao_van_ban_di`.`deleted_at` is null
select count(*) as aggregate from `van_ban_di_cho_duyet` where (`can_bo_nhan_id` = 3 and `trang_thai` = 1)
select count(*) as aggregate from `van_ban_di_cho_duyet` where (`can_bo_nhan_id` = 3 and `trang_thai` = 0 and `tra_lai` = 1)

        $vanBanDi = 0;
        $vanBanDiChoSo = 0;

        $giayMoi = LoaiVanBan::where('ten_loai_van_ban', "LIKE", 'giấy mời')->first();
---
select * from `loai_van_ban` where `ten_loai_van_ban` LIKE 'giấy mời' and `loai_van_ban`.`deleted_at` is null limit 1


        if ($user->hasRole(VAN_THU_DON_VI)) {

            $danhSachVanBanDen = VanBanDen::where('so_van_ban_id', '!=', $giayMoi->id ?? null)
                ->where('type', VanBanDen::TYPE_VB_DON_VI)
                ->where('don_vi_id', $user->don_vi_id)
                ->whereNull('deleted_at')
                ->count();
---
select count(*) as aggregate from `van_ban_den` where `so_van_ban_id` != 100 and `type` = 2 and `don_vi_id` = 2 and `deleted_at` is null and `van_ban_den`.`deleted_at` is null

            array_push($vanThuVanBanDenPiceCharts, array('Danh sách văn bản đến', $danhSachVanBanDen));
            array_push($vanThuVanBanDenCoLors, COLOR_PINTEREST);

            $vanBanDonViChuTri = DonViChuTri::where(['don_vi_id' => $user->don_vi_id])
                ->whereNull('vao_so_van_ban')
                ->whereNull('parent_id')
                ->whereNull('type')
                ->count();
---
select count(*) as aggregate from `dhvbd_don_vi_chu_tri` where (`don_vi_id` = 2) and `vao_so_van_ban` is null and `parent_id` is null and `type` is null

            array_push($vanThuVanBanDenPiceCharts, array('Văn bản đến chờ vào sổ', $vanBanDenDonViChoVaoSo));
            array_push($vanThuVanBanDenCoLors, COLOR_WARNING);

            $giayMoiDen = VanBanDen::where('so_van_ban_id', '=', $giayMoi->id ?? null)
                ->where('type', VanBanDen::TYPE_VB_DON_VI)
                ->where('don_vi_id', $user->don_vi_id)
                ->whereNull('deleted_at')
                ->count();
---
select count(*) as aggregate from `van_ban_den` where `so_van_ban_id` = 100 and `type` = 2 and `don_vi_id` = 2 and `deleted_at` is null and `van_ban_den`.`deleted_at` is null

            array_push($vanThuVanBanDenCoLors, COLOR_GREEN);

            //van ban di
            $giayMoiDi = VanBanDi::where([
                'loai_van_ban_giay_moi' => 2,
                'van_ban_huyen_ky' => $user->don_vi_id,
                'loai_van_ban_id' => $giayMoi->id ?? null
            ])
                ->whereNotNull('so_di')
                ->whereNull('deleted_at')->count();
---
select count(*) as aggregate from `van_ban_di` where (`loai_van_ban_giay_moi` = 2 and `van_ban_huyen_ky` = 2 and `loai_van_ban_id` = 100) and `so_di` is not null and `deleted_at` is null and `van_ban_di`.`deleted_at` is null

            array_push($vanThuVanBanDiPiceCharts, array('Danh sách giấy mời đi', $giayMoiDi));
            array_push($vanThuVanBanDiCoLors, COLOR_RED);

            $vanBanDi = VanBanDi::where(['loai_van_ban_giay_moi' => 1, 'don_vi_soan_thao' => $user->don_vi_id])
                ->where('so_di', '!=', null)->whereNull('deleted_at')
                ->count();
---
select count(*) as aggregate from `van_ban_di` where (`loai_van_ban_giay_moi` = 1 and `don_vi_soan_thao` = 2) and `so_di` is not null and `deleted_at` is null and `van_ban_di`.`deleted_at` is null

            array_push($vanThuVanBanDiPiceCharts, array('Danh sách văn bản đi', $vanBanDi));
            array_push($vanThuVanBanDiCoLors, COLOR_PRIMARY);

            $vanBanDiChoSo = VanBanDi::where(['cho_cap_so' => 2, 'don_vi_soan_thao' => $user->don_vi_id])
                ->count();
---
select count(*) as aggregate from `van_ban_di` where (`cho_cap_so` = 2 and `don_vi_soan_thao` = 2) and `van_ban_di`.`deleted_at` is null

        } else {
            $active = VanBanDen::PHO_CHU_TICH_NHAN_VB;
        }
        $xuLyVanBanDen = XuLyVanBanDen::where('can_bo_nhan_id', $user->id)
            ->whereNull('status')
            ->whereNull('hoan_thanh')
            ->get();
---
select * from `dhvbd_xu_ly_van_ban_den` where `can_bo_nhan_id` = 3 and `status` is null and `hoan_thanh` is null

                $trinhTuNhanVanBan = 5;
            }

            $donViChuTri = DonViChuTri::where('don_vi_id', $user->don_vi_id)
                ->where('can_bo_nhan_id', $user->id)
                ->whereNotNull('vao_so_van_ban')
                ->whereNull('hoan_thanh')
                ->get();
---
select * from `dhvbd_don_vi_chu_tri` where `don_vi_id` = 3 and `can_bo_nhan_id` = 3 and `vao_so_van_ban` is not null and `hoan_thanh` is null


            // VAN BAN HOAN THANH CHO DUYET
            if ($user->hasRole([TRUONG_PHONG, CHANH_VAN_PHONG, PHO_PHONG, PHO_CHANH_VAN_PHONG])) {
                $vanBanHoanThanhChoDuyet = GiaiQuyetVanBan::where('can_bo_duyet_id', $user->id)
                    ->whereNull('status')->count();
---
select count(*) as aggregate from `dhvbd_giai_quyet_van_ban` where `can_bo_duyet_id` = 3 and `status` is null

            //VB DON VI PHOI HOP
            $chuyenTiep = null;

            $donViPhoiHop = DonViPhoiHop::where('don_vi_id', $user->don_vi_id)
                ->where('can_bo_nhan_id', $user->id)
                ->where(function ($query) use ($chuyenTiep) {
                    if (!empty($chuyenTiep)) {
                        return $query->where('chuyen_tiep', $chuyenTiep);
                    } else {
                        return $query->whereNull('chuyen_tiep');
                    }
                })
                ->whereNull('hoan_thanh')
                ->count();
---
select count(*) as aggregate from `dhvbd_don_vi_phoi_hop` where `don_vi_id` = 3 and `can_bo_nhan_id` = 3 and (`chuyen_tiep` is null) and `hoan_thanh` is null

            }

            // CONG VIEC DON VI
            $congViecDonViChoXuLy = ChuyenNhanCongViecDonVi::where('can_bo_nhan_id', $user->id)
                ->whereNull('type')
                ->whereNull('chuyen_tiep')
                ->orWhere('chuyen_tiep', 0)
                ->whereNull('hoan_thanh')
                ->count();
---
select count(*) as aggregate from `chuyen_nhan_cong_viec_don_vi` where `can_bo_nhan_id` = 3 and `type` is null and `chuyen_tiep` is null or `chuyen_tiep` = 0 and `hoan_thanh` is null

            array_push($congViecPhongBanCoLors, COLOR_ORANGE);

            if ($user->hasRole([TRUONG_PHONG, CHANH_VAN_PHONG, PHO_PHONG, PHO_CHANH_VAN_PHONG])) {
                $giaHanCongViecDonVi = CongViecDonViGiaHan::where('can_bo_nhan_id', $user->id)
                    ->where('status', CongViecDonViGiaHan::STATUS_CHO_DUYET)
                    ->count();
                array_push($congViecPhongBanPiceCharts, array('CV xin gia hạn', $giaHanCongViecDonVi));
                array_push($congViecPhongBanCoLors, COLOR_PINTEREST);

                $congViecDonViHoanThanhChoDuyet = GiaiQuyetCongViecDonVi::where('lanh_dao_duyet_id', $user->id)
                    ->whereNull('status')
                    ->count();
---
select count(*) as aggregate from `cong_viec_don_vi_gia_han` where `can_bo_nhan_id` = 3 and `status` = 1
select count(*) as aggregate from `giai_quyet_cong_viec_don_vi` where `lanh_dao_duyet_id` = 3 and `status` is null

                array_push($congViecPhongBanCoLors, COLOR_PURPLE);

                //cv don vi phoi hop
                $congViecDonViPhoiHopChoXuLy = ChuyenNhanCongViecDonVi::where('can_bo_nhan_id', $user->id)
                    ->where('type', ChuyenNhanCongViecDonVi::TYPE_DV_PHOI_HOP)
                    ->whereNull('chuyen_tiep')
                    ->whereNull('hoan_thanh')
                    ->count();
---
select count(*) as aggregate from `chuyen_nhan_cong_viec_don_vi` where `can_bo_nhan_id` = 3 and `type` = 1 and `chuyen_tiep` is null and `hoan_thanh` is null

            }
        }

        $vanBanXinGiaHan = GiaHanVanBan::with('vanBanDen',
            'CanBoChuyen', 'CanBoNhan')
            ->where('can_bo_nhan_id', $user->id)
            ->where('status', GiaHanVanBan::STATUS_CHO_DUYET)
            ->count();
---
select count(*) as aggregate from `dhvbd_gia_han_van_ban` where `can_bo_nhan_id` = 3 and `status` = 1

        $trinhTuNhanVanBan = null;

        if ($user->hasRole([CHU_TICH, PHO_CHUC_TICH, CHANH_VAN_PHONG, PHO_CHANH_VAN_PHONG, TRUONG_PHONG, PHO_PHONG, CHUYEN_VIEN])) {
            $xuLyVanBanDen = XuLyVanBanDen::where('can_bo_nhan_id', $user->id)
                ->whereNull('status')
                ->whereNull('hoan_thanh')
                ->get();
---
select * from `dhvbd_xu_ly_van_ban_den` where `can_bo_nhan_id` = 3 and `status` is null and `hoan_thanh` is null

        if ($user->hasRole(TRUONG_PHONG) || $user->hasRole(CHANH_VAN_PHONG) || $user->hasRole(CHUYEN_VIEN) ||
            $user->hasRole(PHO_PHONG) || $user->hasRole(PHO_CHANH_VAN_PHONG)) {

            $donViChuTri = DonViChuTri::where('don_vi_id', $user->don_vi_id)
                ->where('can_bo_nhan_id', $user->id)
                ->whereNotNull('vao_so_van_ban')
                ->whereNull('hoan_thanh')
                ->get();
---
select * from `dhvbd_don_vi_chu_tri` where `don_vi_id` = 3 and `can_bo_nhan_id` = 3 and `vao_so_van_ban` is not null and `hoan_thanh` is null

            $arrVanBanDenId = $donViChuTri->pluck('van_ban_den_id')->toArray();
        }

        $vanBanQuaHanDangXuLy = VanBanDen::whereIn('id', $arrVanBanDenId)
            ->where('trinh_tu_nhan_van_ban', '>', $trinhTuNhanVanBan)
            ->where('trinh_tu_nhan_van_ban', '!=', VanBanDen::HOAN_THANH_VAN_BAN)
            ->where(function ($query) use ($currentDate) {
                return $query->where('han_xu_ly', '<', $currentDate);
            })
            ->count();
---
select count(*) as aggregate from `van_ban_den` where 0 = 1 and `trinh_tu_nhan_van_ban` > 3 and `trinh_tu_nhan_van_ban` != 7 and (`han_xu_ly` < '2020-12-22') and `van_ban_den`.`deleted_at` is null